## tofu plan l6_ingress/app-fini-domain-trust

added alias domains

```terraform

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # digitalocean_app.trust_static_site will be created
  + resource "digitalocean_app" "trust_static_site" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + id                   = (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      + project_id           = (known after apply)
      + updated_at           = (known after apply)
      + urn                  = (known after apply)

      + dedicated_ips (known after apply)

      + spec {
          + disable_edge_cache              = false
          + disable_email_obfuscation       = false
          + domains                         = (known after apply)
          + enhanced_threat_control_enabled = false
          + features                        = (known after apply)
          + name                            = "fini-domain-trust"
          + region                          = "nyc"

          + domain {
              + name     = "vccinc.net"
              + type     = "PRIMARY"
              + wildcard = (known after apply)
            }
          + domain {
              + name     = "perlclass.org"
              + type     = "ALIAS"
              + wildcard = (known after apply)
            }
          + domain {
              + name     = "perlclasses.org"
              + type     = "ALIAS"
              + wildcard = (known after apply)
            }

          + ingress (known after apply)

          + static_site {
              + environment_slug = "html"
              + name             = "trust-public"
              + source_dir       = "trust/public"

              + github {
                  + branch         = "main"
                  + deploy_on_push = true
                  + repo           = "fini-net/fini-domain-trust"
                }

              + routes (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + active_deployment_id = (known after apply)
  + app_id               = (known after apply)
  + app_urn              = (known after apply)
  + custom_domains       = [
      + "vccinc.net",
      + "perlclass.org",
      + "perlclasses.org",
    ]
  + default_ingress      = (known after apply)
  + github_branch        = "main"
  + github_repo          = "fini-net/fini-domain-trust"
  + live_url             = (known after apply)
```
